In [17]:
import numpy as np
import pandas as pd
pd.set_option("display.max_columns", None)
import pickle
import compress_pickle

# Load the model

In [18]:
# MODEL_PATH = r"/mnt/e/Projects/regression/risk_modelling/model_weights/rf_regression.pkl"
MODEL_PATH = r"/mnt/e/Projects/regression/risk_modelling/model_weights/rf_regression.gz"
COLUMN_PATH = r"/mnt/e/Projects/regression/risk_modelling/model_weights/rf_regression_columns.pkl"
OHE_PATH = r"/mnt/e/Projects/regression/risk_modelling/model_weights/ohe.pkl"
categorical_variables = ["MARRIED", "OCCAT1", "OCCAT2"]

In [19]:
with open(MODEL_PATH, "rb") as file_handle:
    final_model = compress_pickle.load(file_handle)

with open(COLUMN_PATH, "rb") as file_handle:
    column_list = pickle.load(file_handle)

with open(OHE_PATH, "rb") as file_handle:
    ohe = pickle.load(file_handle)

# Prepare new data for inference

In [20]:
column_list

['AGE', 'EDUC', 'MARRIED', 'OCCAT1', 'OCCAT2', 'KIDS', 'NETWORTH', 'INCOME']

In [21]:
data = pd.DataFrame(
    [[27, 14, 2, 1, 1, 0, 57000, 66000],
     [30, 14, 2, 1, 1, 0, 90000, 100000],
     [35, 14, 1, 1, 1, 1, 100000, 250000],
     [60, 14, 1, 1, 1, 1, 90000, 100000],
     [60, 14, 1, 1, 1, 1, 90000, 100000],],
    columns=column_list
)
data

   AGE  EDUC  MARRIED  OCCAT1  OCCAT2  KIDS  NETWORTH  INCOME
0   27    14        2       1       1     0     57000   66000
1   30    14        2       1       1     0     90000  100000
2   35    14        1       1       1     1    100000  250000
3   60    14        1       1       1     1     90000  100000
4   60    14        1       1       1     1     90000  100000

In [22]:
encodings_data = pd.DataFrame(ohe.transform(data[categorical_variables]).toarray())
encodings_data.columns = ohe.get_feature_names_out()

data = data.drop(columns=categorical_variables).reset_index(drop=True)
data = pd.concat([data, encodings_data], axis=1)
data.head(3)

,AGE,EDUC,KIDS,NETWORTH,INCOME,MARRIED_2,OCCAT1_2,OCCAT1_3,OCCAT1_4,OCCAT2_2,OCCAT2_3,OCCAT2_4
0,27,14,0,57000,66000,1.0,0.0,0.0,0.0,0.0,0.0,0.0
1,30,14,0,90000,100000,1.0,0.0,0.0,0.0,0.0,0.0,0.0
2,35,14,1,100000,250000,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [23]:
final_model.predict(data)

array([0.34461483, 0.03499115, 0.22797819, 0.06183449, 0.06183449])